src/Catalogs/Files.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Files</Name>
			<Comment>Files in folders</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Comment>Author - User, who added the file</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FileFolders</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Comment>Date of adding file to the database</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Encrypted</Name>
					<Comment>Encrypted</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PictureIndex</Name>
					<Comment>Index of an icon, corresponding to the file extension, to be displayed in the list</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Details</Name>
					<Comment>File description</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Signed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileName</Name>
					<Comment>Full description (of length of up to 256 chars)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LockedBy</Name>
					<Comment>User, locked file for edit</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextStorage</Name>
					<Comment>Text, extracted from file - for full-text search</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersion</Name>
					<Comment>Active version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionAuthor</Name>
					<Comment>Author - User, who created the version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionDateCreated</Name>
					<Comment>Version create date</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVersionNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionFilePath</Name>
					<Comment>Additional path to a file on drive (in case if FileStorageType - "on drive")</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionSize</Name>
					<Comment>Size of versions' file</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionExtension</Name>
					<Comment>Version file extension</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVolume</Name>
					<Comment>Ref to volume (if FileStorageType = 'on drive' )</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileStorageVolumes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StoreVersions</Name>
					<Comment>Store versions - if False, file always has single Active version</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalDataAndAttributes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalDataAndAttributes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>EncryptionCertificates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Imprint</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/FileVersions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>FileVersions</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Files</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Comment>Author - User, who created the version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ModificationDateUniversal</Name>
					<Comment>File modification date - converted to Greenwich (without summer and time zone offsets)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Comment>Version create date</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Encrypted</Name>
					<Comment>Encrypted</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PictureIndex</Name>
					<Comment>Index of an icon, corresponding to the file extension, to be displayed in the list</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Comment>Comment for versions</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VersionNo</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileName</Name>
					<Comment>Full description (of length of up to 256 chars)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FilePath</Name>
					<Comment>Additional path to a file on drive (in case if FileStorageType - "on drive")</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Size</Name>
					<Comment>Size of versions' file</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Extension</Name>
					<Comment>Version file extension</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParentalVersion</Name>
					<Comment>Parent version for current version - tree structure of versions is possible</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextExtractionStatus</Name>
					<Comment>Text extraction status - for a background job of text extraction</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.FileTextExtractionStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextStorage</Name>
					<Comment>Text, extracted from file - for full-text search</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileStorageType</Name>
					<Comment>Where files are stored - in database as ValueStorage or in directory on drive</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.FileStorageTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Volume</Name>
					<Comment>Ref to volume (if FileStorageType = 'on drive' )</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileStorageVolumes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileStorage</Name>
					<Comment>File Versions</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Files/Forms/FolderExportForm/Ext/Form/Module.bsl
&AtClient
Procedure UnloadRun()
	#If NOT WebClient Then
		// Check - if dump directory exists. if not - create it
		UnloadDirectory = New File(FolderForExport);
		
		If not UnloadDirectory.Exist() Then
			
			Try
				
				CreateDirectory(FolderForExport);
				
			Except
				
				InfoError = ErrorInfo();
				DoMessageBox(NStr("en = 'Failed to create the dump folder'") + Chars.CR + NStr("en = 'Cause:'") + InfoError.Details);
				Return;
				
			EndTry;
			
		EndIf;
		
		Status(StringFunctionsClientServer.SubstitureParametersInString(
		            NStr("en = 'Exporting folder ""%1""...Please wait.'"),
		            String(WhatWeSave) ));
		// Get list of files being dumped
		GenerateFileTree(WhatWeSave);
		
		// Create form in advance, to avoid spending time after
		QuestionForm = GetForm("Catalog.Files.Form.FileExists");
		
		// Begin dump now
		UnloadedFolderHaventBeenMetYet = True;
		Success = BypassFileTree(QuestionForm, FileTree, FolderForExport, False, "", UnloadedFolderHaventBeenMetYet, WhatWeSave);
		
		QuestionForm = Undefined;
		
		If Success Then
			PathBeingSaved = FolderForExport;
			
			FolderName = String(WhatWeSave) + "\";
			EndOfPath = Right(FolderForExport, StrLen(FolderName));
			
			If EndOfPath = FolderName Then
				PathBeingSaved = Left(FolderForExport, StrLen(FolderForExport) - StrLen(FolderName));
			EndIf;
			
			CommonUse.CommonSettingsStorageSave("UnloadFolderName", "UnloadFolderName",  PathBeingSaved);
			
			Status(StringFunctionsClientServer.SubstitureParametersInString(
			             NStr("en = 'Export folder ""% 1"" to folder ""% 2"" has been successfully completed!'"),
			             String(WhatWeSave), String(FolderForExport) ) );
			
			Close();
			
		EndIf;
	#EndIf
EndProcedure

&AtClient
Procedure FolderForExportOnChange(Item)
	FolderForExport = FileFunctionsClient.NormalizeDirectory(FolderForExport);
EndProcedure

&AtClient
Procedure FolderForExportStartChoice(Item, ChoiceData, StandardProcessing)
	#If NOT WebClient Then
		// Open saving folder choice window
		StandardProcessing = False;
		FileChoice = New FileDialog(FileDialogMode.ChooseDirectory);
		FileChoice.Multiselect = False;
		FileChoice.Directory = FolderForExport;
		If FileChoice.Choose() Then
			FolderForExport = FileFunctionsClient.NormalizeDirectory(FileChoice.Directory);
		EndIf;
	#EndIf
EndProcedure

&AtServer
Procedure OnCreate(Cancellation, StandardProcessing)
	
	If Parameters.ExportFolder <> Undefined Then
		WhatWeSave = Parameters.ExportFolder;
	EndIf;
	
EndProcedure

&AtServer
Procedure GenerateFileTree(FolderParent) Export
	Query = New Query;
	Query.Text = "SELECT ALLOWED
	               |	Files.FileOwner AS Folder,
	               |	Files.FileOwner.Description AS FolderDescription,
	               |	Files.CurrentVersion,
	               |	Files.FileName AS Details,
	               |	Files.CurrentVersion.Extension AS Extension,
	               |	Files.CurrentVersion.Size AS Size,
	               |	Files.CurrentVersion.DateModifiedUniversal AS DateModifiedUniversal,
	               |	Files.Ref,
	               |	Files.DeletionMark,
	               |	Files.Encrypted
	               |FROM
	               |	Catalog.Files AS Files
	               |WHERE
	               |	Files.FileOwner In HIERARCHY(&Ref)
	               |	And Files.CurrentVersion <> VALUE(Catalog.FileVersions.EmptyRef)
	               |	And Files.DeletionMark = FALSE
	               |TOTALS BY
	               |	Folder HIERARCHY";
	Query.Parameters.Insert("Ref", FolderParent);
	Result = Query.Execute();
	UnloadTable = Result.Unload(QueryResultIteration.ByGroupsWithHierarchy);
	ValueToFormAttribute(UnloadTable, "FileTree");
EndProcedure

// Recursive function, which performs files dump to the local drive
//
// Parameters:
//  QuestionForm - object of type "ManagedForm", that contains ref
//                 to the created in memory question form about overwrite of file with flag
//                 "For all". Form is created, to save time on
//                 regular form creation inside the recursive loop.
//  FileTable 	 - value tree with the files being dumped.
//  BaseSaveDirectory - string with directory name, where files being saved.
//                 Folder structure is recreated inside (as in file tree)
//                 if required.
//  ForAllFiles - type Boolean
//                 True: user picked action on file overwrite and
//                 raised flag "For all". Do not ask more questions.
//                 False: in each case when file with the name same as in infobase
//                 exists on drive, question will be asked.
//  BasicAction - type DialogReturnCode
//                 on executing one action for all conflicts on file
//                 write (parameter ForAllFiles = True) action,
//                 specified by this parameter, is executed).
//                 .Yes - overwrite
//                 .Ignore - ignore file
//                 .Abort - abort dump
//
// Value returned:
//  True       - can continue dump / dump completed successfully
//  False      - action completed with errors / dump completed with errors
&AtClient
Function BypassFileTree(QuestionForm, FileTable, Val BaseSaveDirectory, ForAllFiles = False, BasicAction = "", UnloadedFolderHaventBeenMetYet, ParentFolder)
	#If NOT WebClient Then
	
		If BasicAction = "" Then
			// By default do the less harmful action
			BasicAction = DialogReturnCode.Ignore;
		EndIf;
		
		For Each FileWrite in FileTable.GetItems() Do
			
			If UnloadedFolderHaventBeenMetYet = True Then
				If FileWrite.Folder = WhatWeSave Then
					UnloadedFolderHaventBeenMetYet = False;
				EndIf;
			EndIf;
			
			If UnloadedFolderHaventBeenMetYet = True Then
				If Not BypassFileTree(QuestionForm, FileWrite, BaseSaveDirectory, ForAllFiles, BasicAction, UnloadedFolderHaventBeenMetYet, FileWrite.Folder) Then
					Return False;
				EndIf;
				
				Continue;
			EndIf;
			
			// Generate directory path and go further. Directories will be created
			BaseSaveDirectoryFile = BaseSaveDirectory;
			If (FileWrite.Folder <> WhatWeSave) And FileWrite.CurrentVersion.IsEmpty() Then
				If ParentFolder <> FileWrite.Folder Then
					BaseSaveDirectoryFile = BaseSaveDirectoryFile + FileWrite.FolderDescription + "\";
				EndIf;
			EndIf;
			
			// Check presence of the base directory: if not - create
			Folder = New File(BaseSaveDirectoryFile);
			If Not Folder.Exist() Then
				While True Do
					Try
						CreateDirectory(BaseSaveDirectoryFile);
						Break;
					Except
						//Why directory has not been created...
						infoError = ErrorInfo();
						
						strText =
						StringFunctionsClientServer.SubstitureParametersInString(
						     NStr("en = 'An error occured when creating folder: %1.
                                   |Cause: %2'"),
						     BaseSaveDirectoryFile,
						     ?(infoError.Cause = Undefined, "Undefined", infoError.Cause.Details) );
						
						Result = DoQueryBox(strText, QuestionDialogMode.AbortRetryIgnore, , DialogReturnCode.Retry);
						If Result = DialogReturnCode.Abort Then
							// Just exit with error
							Return False;
						ElsIf Result = DialogReturnCode.Ignore Then
							// Skip this tree branch and continue further
							Return True;
						Else
							// Try to repeat folder creation
							Continue;
						EndIf;
					EndTry;
				EndDo;
			EndIf;
			
			
			// only in case, when there is at least one file in this folder
			ChildElements = FileWrite.GetItems();
			If ChildElements.Count() <> 0 Then
				groupName = BaseSaveDirectoryFile;
				If Not BypassFileTree(QuestionForm, FileWrite, groupName, ForAllFiles, BasicAction, UnloadedFolderHaventBeenMetYet, FileWrite.Folder) Then
					Return False;
				EndIf;
			EndIf;
			
			If FileWrite.CurrentVersion <> NULL And FileWrite.CurrentVersion.IsEmpty() Then
				// This is item of catalog Files without file - skip
				Continue;
			EndIf;
			
			// Write file to the base directory
			FileNameWithExtension = FileFunctionsClient.GetNameWithExtention(FileWrite.Details, FileWrite.Extension);
			If FileWrite.Encrypted Then
				FileNameWithExtension = FileNameWithExtension + "." + ExtensionForEncryptedFiles; 
			EndIf;	
			FullFileName = BaseSaveDirectoryFile + FileNameWithExtension;
			
			// Check if we can write the file
			Result = DialogReturnCode.Cancel;
			While True Do
				FileOnDrive = New File(FullFileName);
				If FileOnDrive.Exist() And FileOnDrive.IsDirectory() Then
					QuestionText =
					StringFunctionsClientServer.SubstitureParametersInString(
					  NStr("en = 'Cannot export the file %1 because there is a folder with the same name. Retry exporting?'"),
					  FullFileName );
					
					Result = DoQueryBox(QuestionText, QuestionDialogMode.RetryCancel, ,DialogReturnCode.Cancel);
					If Result = DialogReturnCode.Retry Then
						
						// Ignore current file
						Continue;
					EndIf;
				Else
					
					// No file - go further
					Result = DialogReturnCode.Retry;
				EndIf;
				Break;
			EndDo;
			If Result = DialogReturnCode.Cancel Then
				
				// Ignore file with the same name as folder name
				Continue;
			EndIf;
			Result = DialogReturnCode.No;
			
			// Ask, what to do with the current file
			If FileOnDrive.Exist() Then
				
				// If file has R | O and modification time is less, than in infobase - simply overwrite it
				If FileOnDrive.GetReadOnly() And FileOnDrive.GetModificationTime() <= FileWrite.DateModifiedUniversal Then
					Result = DialogReturnCode.Yes;
				Else
					If Not ForAllFiles Then
						Text = 
						StringFunctionsClientServer.SubstitureParametersInString(
						      NStr("en = 'The folder %1 contains the file %2 (size = %3 bytes, modified on %4). The file being saved has size %5 bytes, modified on %6. Overwrite the existing file?'"),
						      BaseSaveDirectoryFile,
						      FileNameWithExtension,
						      FileOnDrive.Size(),
						      FileOnDrive.GetModificationTime(),
						      FileWrite.Size,
						      FileWrite.DateModifiedUniversal );
						
						QuestionForm.TextOfMessage = Text;
						QuestionForm.ApplyForAll = ForAllFiles;
						QuestionForm.SetDefaultsButton(BasicAction);
						
						// Yes 		- overwrite
						// Ignore 	- ignore file
						// Abort 	- abort dump
						Result 		= QuestionForm.DoModal();
						ForAllFiles = QuestionForm.ApplyForAll;
						BasicAction = Result;
					Else
						Result = BasicAction;
					EndIf;
					If Result = DialogReturnCode.Abort Then
						
						// Abort dump
						Return False;
					ElsIf Result = DialogReturnCode.Ignore Then
						
						// Skip this file
						Continue;
					EndIf;
				EndIf;
			Else
				
				// No file, no questions
				Result = DialogReturnCode.Yes;
			EndIf;
			
			// If possible - write file to a hard drive
			If Result = DialogReturnCode.Yes Then
				While True Do
					Try
						FileOnDrive = New File(FullFileName);
						If FileOnDrive.Exist() Then
							
							// Remove R | O flag to be able to delete it
							FileOnDrive.SetReadOnly(False);
						EndIf;
						
						// Always delete first and then recreate
						DeleteFiles(FullFileName);
						
						SizeInMb = FileWrite.Size / (1024 * 1024);
						
						// Update progress indicator
						LabelMoreDetailed =
						StringFunctionsClientServer.SubstitureParametersInString(
							NStr("en = 'Saving file %1 (%2 MB)...'"),
							FileOnDrive.Name,
							?(SizeInMb >= 1, Format(SizeInMb, "NFD=0"), Format(SizeInMb, "NFD=1; NZ=0")) );
						
						Status(
							StringFunctionsClientServer.SubstitureParametersInString(
						    	NStr("en = 'Exporting folder %1'"), FileWrite.FolderDescription),
							,
							LabelMoreDetailed, 
							PictureLib.Information32);
						
						// Write file over again
						strAddress = FileOperations.GetURLForOpening(FileWrite.CurrentVersion, Uuid);
						GetFile(strAddress, FullFileName, False);
						
						// for the variant when files are located on disk (at server) - delete file from temporary storage after getting it
						If IsTempStorageURL(strAddress) Then
							DeleteFromTempStorage(strAddress);
						EndIf;
						
						FileOnDrive = New File(FullFileName);
						
						// Make file read only
						FileOnDrive.SetReadOnly(True);
						
						FileToBeCreatedOnDriveDate = FileWrite.DateModifiedUniversal;
						CommonUseClient.ConvertSummerTimeToCurrentTime(FileToBeCreatedOnDriveDate);
						
						// Assign modification time - as in infobase
						FileOnDrive.SetModificationTime(FileToBeCreatedOnDriveDate);
						Break;
					Except
						
						// For some reason file error has occured on file write and modification of file attributes ...
						infoError = ErrorInfo();
						strText =
						StringFunctionsClientServer.SubstitureParametersInString(
						  NStr("en = 'Error writing file %1.
                                |
                                |Cause: %2'"),
						  FullFileName,
						  ?(infoError.Cause = Undefined, "Undefined", infoError.Cause.Details) );
						
						Result = DoQueryBox(strText, QuestionDialogMode.AbortRetryIgnore, , DialogReturnCode.Retry);
						If Result = DialogReturnCode.Abort Then
							
							// Just exit with error
							Return False;
						ElsIf Result = DialogReturnCode.Ignore Then
							
							// Skip this file and go further
							Break;
						Else
							
							// Try to repeat folder creation
							Continue;
						EndIf;
					EndTry;
				EndDo;
			EndIf;
		EndDo;
		
		Return True;
		
	#EndIf
EndFunction // BypassFileTree()

&AtClient
Procedure FolderForExportOpen(Item, StandardProcessing)
	#If NOT WebClient Then
	
		// Open folder for preview here - in case we will need to do something
		StandardProcessing = False;
		If Not IsBlankString(FolderForExport) Then
			File = New File(FolderForExport);
			If File.Exist() Then
				RunApp(FolderForExport);
			Else
				DoMessageBox(NStr("en = 'It is impossible to open the dump folder. The folder might have not been created yet'"));
			EndIf;
		EndIf;
	
	#EndIf
EndProcedure

&AtClient
Procedure OnOpen(Cancellation)
	
	#If WebClient Then
		DoMessageBox(NStr("en = 'Catalogs export are not supported at web-client.'"));
		Cancellation = True;
		Return;
	#EndIf
	
	// Assign as dump folder My Documents folder
	// or the folder, where files have been dumped last time
	FolderForExport = FileFunctionsClient.LatestUnloadDirectory() + String(WhatWeSave) + "\";
EndProcedure
